openfoam_data/simulation/fene_p/four_obstacle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          44;
        startFace       18078;
    }
    symmetry
    {
        type            symmetryPlane;
        nFaces          270;
        startFace       18122;
    }
    fixedWalls
    {
        type            wall;
        nFaces          446;
        startFace       18392;
        closedSolidBodyMotion false;
    }
    outlet
    {
        type            patch;
        nFaces          44;
        startFace       18838;
    }
    frontAndBack
    {
        type            empty;
        nFaces          18480;
        startFace       18882;
    }
)


// ************************************************************************* //
